[{"title": "A simple and fast responsive colorimetric moisture sensor based on symmetrical conjugated polymer", "link": "https://www.sciencedirect.com/science/article/pii/S0925400520302537", "abstract": "This work describes a colorimetric moisture sensor based on conjugated polydiacetylene for\nhumidity/moisture with a rapid blue to red colorimetric response. The moisture responsive …", "key": "A Series of N-alkylimidazolium cited by_1_16637802"}, {"title": "Improved efficiency of dye-sensitized solar cell based on randomly ordered pore structure fabricated by dry deposition method", "link": "https://www.sciencedirect.com/science/article/pii/S156717391730007X", "abstract": "Porous TiO 2 films were deposited onto FTO (fluorine doped tin oxide) substrate through dry\ndeposition method, and polystyrene (PS) beads used as a sacrificial material. In addition …", "key": "Calculating current density–vo cited by_1_16637717"}, {"title": "Surface State‐Mediated Charge Transfer of Cs2SnI6 and Its Application in Dye‐Sensitized Solar Cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/aenm.201803243", "abstract": "… Because it is expected that the surface state of Cs 2 SnI 6 is capable of regenerating oxidized\norganic dyes, a Cs 2 SnI 6 ‐based regenerator is developed for a dye‐sensitized solar cell …", "key": "dye sensitized solar cells_1_1664168266041"}, {"title": "Effects of structure and electronic properties of D-π-A organic dyes on photovoltaic performance of dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S209549562030396X", "abstract": "… the performance of dye-sensitized solar cells containing five D-π-A organic dyes designed\nby systematic modification of π-bridge size and geometric structure. Each dye has a simple …", "key": "dye sensitized solar cells_1_1664168349378"}, {"title": "Photovoltaic performance of dye-sensitized solar cells containing ZnO microrods", "link": "https://www.mdpi.com/577544", "abstract": "… The dominance of inorganic solid-state junction cells is being challenged by the advent …\ncells such as dye-sensitized solar cells (DSSCs), polymer solar cells, and perovskite solar cells [1…", "key": "dye sensitized solar cells_1_1664168387852"}, {"title": "Toward Eco-Friendly Dye-Sensitized Solar Cells (DSSCs): Natural Dyes and Aqueous Electrolytes", "link": "https://www.mdpi.com/1996-1073/15/1/219", "abstract": "Due to their low cost, facile fabrication, and high-power conversion efficiency (PCE), dye-sensitized\nsolar cells (DSSCs) have attracted much attention. Ruthenium (Ru) complex dyes …", "key": "dye sensitized solar cells_1_1664168441257"}, {"title": "Enhancement of dye‐sensitized solar cells efficiency using graphene quantum dots as photoanode", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/bkcs.11664", "abstract": "… Dye-sensitized solar cell (DSSC) is a candidate to substitute … -electrodes of dye-sensitized\nphotovoltaic cells. The incorporation … candidate for dye-sensitized solar cells, optoelectronics, …", "key": "dye sensitized solar cells_1_1664168494349"}, {"title": "Molecular design and synthesis of D–π–A structured porphyrin dyes with various acceptor units for dye-sensitized solar cells", "link": "https://pubs.rsc.org/en/content/articlehtml/2018/tc/c8tc05283b", "abstract": "… Our study has underlined the importance of the adsorbed mode for a sensitizer and this\nshould be seriously considered in future rational designs of dye-sensitized solar cells. …", "key": "dye sensitized solar cells_1_1664168900256"}, {"title": "Edge‐functionalized graphene nanoplatelets as metal‐free electrocatalysts for dye‐sensitized solar cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adma.201804440", "abstract": "… Since first being reported in 1991, dye-sensitized solar cells (DSSCs), as a promising low-cost\nsolar cell technology, have been actively studied.1 To address environmental and energy …", "key": "dye sensitized solar cells_1_1664169410085"}, {"title": "Pt-free, cost-effective and efficient counter electrode with carbon nanotube yarn for solid-state fiber dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S0143720820315527", "abstract": "… Fiber-shaped solar cells have attracted significant attention for their potential applications in\n… replace rare and expensive noble metals in dye-sensitized solar cells (DSSCs) is a research …", "key": "dye sensitized solar cells_1_1664169536650"}, {"title": "Theoretical investigation of azobenzene-based photochromic dyes for dye-sensitized solar cells", "link": "https://www.mdpi.com/711902", "abstract": "… of the resultant dye-sensitized solar cells (DSSCs). These theoretical calculations can be\nused for the rapid screening of promising dyes and their optimization for photochromic DSSCs. …", "key": "dye sensitized solar cells_1_1664169589975"}, {"title": "Solvothermally synthesized anatase TiO2 nanoparticles for photoanodes in dye-sensitized solar cells", "link": "https://www.tandfonline.com/doi/abs/10.1080/14686996.2021.1873059", "abstract": "… Fabrication of flexible dye sensitized solar cells on plastic … A robust organic dye for dye\nsensitized solar cells based on … Fabrication of thin film dye-sensitized solar cells with solar to …", "key": "dye sensitized solar cells_1_1664169659361"}, {"title": "Effect of regioisomeric substitution patterns on the performance of quinoxaline-based dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S0013468618328524", "abstract": "… solar energy is the most abundant and promising alternative source. Over the past decades,\ndye-sensitized solar cells … dye [[2], [3], [4], [5], [6], [7], [8]]. Especially, the design of an efficient …", "key": "dye sensitized solar cells_1_1664169926369"}, {"title": "Transformation of a liquid electrolyte to a gel inside dye sensitized solar cells for better stability and performance", "link": "https://www.sciencedirect.com/science/article/pii/S0040609020302364", "abstract": "… of solar cells use solar energy to convert the energy from photons to electricity [5]. Dye\nsensitized solar cells (… solar energy [12]. Lastly, the efficiency of DSSCs is far more superior to Si-…", "key": "dye sensitized solar cells_1_1664170006747"}, {"title": "Preparation of quasi-solid-state electrolytes using a coal fly ash derived zeolite-X and-A for dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S1226086X18311821", "abstract": "… Since the first report by O’Regan and Grätzel in 1991, dye sensitized solar cells (DSSCs)\nhave been drawn tremendous attention as promising solar cells because of their easy and …", "key": "dye sensitized solar cells_1_1664170183643"}, {"title": "Theoretical design and characterization of NIR porphyrin-based sensitizers for applications in dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S0038092X19306188", "abstract": "… The introduction of conjugated isolation groups into the common acceptor cyanoacrylic acid:\nAn efficient strategy to suppress the charge recombination in dye sensitized solar cells and …", "key": "dye sensitized solar cells_1_1664170345712"}, {"title": "Photovoltaic characteristics of multiwalled carbon nanotube counter-electrode materials for dye-sensitized solar cells produced by chemical treatment and addition of …", "link": "https://www.mdpi.com/445712", "abstract": "Multiwalled carbon nanotubes (MWCNTs) have excellent electrical conductivity and good\nchemical stability, and are used as counter electrodes in dye-sensitized solar cells (DSSCs). …", "key": "dye sensitized solar cells_1_1664170829655"}, {"title": "Aerosol synthesis and luminescent properties of CaAl2O4: Eu2+, Nd3+ down-conversion phosphor particles for enhanced light harvesting of dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S0038092X18312040", "abstract": "… The dye molecules generally used in the photoelectrodes of dye-sensitized solar cells (DSSCs)\nare mostly effective for harvesting visible light. However, the ultraviolet (UV) light …", "key": "dye sensitized solar cells_1_1664170879183"}, {"title": "Multi-walled carbon nanotube forests covered with atomic-layer-deposited ruthenium layers for high-performance counter electrodes of dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S1566119918306219", "abstract": "… devices such as organic/inorganic thin-film transistors, solar cells, and light-emitting devices\n[1,2]. … used as the collecting electrode of dye-sensitized solar cells (DSSCs) due to their high …", "key": "dye sensitized solar cells_1_1664171106989"}, {"title": "Optimization of Pt loading on the counter electrode for efficient and bifacial dye-sensitized solar cells with polymer gel electrolyte", "link": "https://link.springer.com/article/10.1007/s11814-022-1170-8", "abstract": "… as alternatives to conventional crystalline Si solar cells owing to their low … dye-sensitized\nsolar cells (DSSCs) offer unique attractive features compared to other next-generation solar cells…", "key": "dye sensitized solar cells_1_1664171149544"}, {"title": "Energy-level engineering of the electron transporting layer for improving open-circuit voltage in dye and perovskite-based solar cells", "link": "https://pubs.rsc.org/en/content/articlehtml/2017/sc/c8ee03672a", "abstract": "… Perovskite solar cells (PSCs), including dye-sensitized solar cells (DSSCs), have been …\nhigh-efficiency solar cells with properties that are difficult to achieve with conventional solar cell …", "key": "dye sensitized solar cells_1_1664171357725"}, {"title": "Historical Analysis of High‐Efficiency, Large‐Area Solar Cells: Toward Upscaling of Perovskite Solar Cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adma.202002202", "abstract": "… Figure 1a shows the evolution of perovskite solar cells. After the first demonstration of\nperovskite-sensitized solar cells with a power conversion efficiency (PCE) of 3.8% in 2008, [ 9 ] …", "key": "dye sensitized solar cells_1_1664172152657"}, {"title": "Enhanced electrocatalytic activity and electrochemical stability of Cu2S/PbS counter electrode for quantum-dot-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S0169433220314008", "abstract": "… (QD)-sensitized solar cells (QDSSCs) have attracted significant attention as a third-generation\nsolar cell in … Pt CEs are typically used in dye-sensitized solar cells, which exhibit superior …", "key": "dye sensitized solar cells_1_1664172188529"}, {"title": "A stable gel electrolyte based on poly butyl acrylate (PBA)-co-poly acrylonitrile (PAN) for solid-state dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S0009261420306710", "abstract": "This work deals the preparation of a new polymer gel electrolyte using an efficient poly (acrylonitrile)-co-poly\n(butyl acrylate) (PAN-co-PBA) for solid-state DSSCs. Prepared PAN-co-…", "key": "dye sensitized solar cells_3_1664169892959"}, {"title": "Novel rod-shaped organic sensitizers for liquid and quasi-solid-state dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S001346861832615X", "abstract": "… including dye-sensitized solar cells (DSSCs), polymer solar cells, and perovskite solar cells\n… Among them, the low-cost, high-efficiency and easy-fabrication dye-sensitized solar cells (…", "key": "dye sensitized solar cells_3_1664169892959"}, {"title": "Electropolymerization and application of polyoxometalate-doped polypyrrole film electrodes in dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S1388248120302307", "abstract": "… The PW 12 -PPy composite film was used as an efficient Pt-free counter electrode in a\ndye-sensitized solar cell (DSSC). The surface appearance, chemical composition and internal …", "key": "dye sensitized solar cells_3_1664169892959"}, {"title": "Fractional structured molybdenum oxide catalyst as counter electrodes of all-solid-state fiber dye-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S0021979720313187", "abstract": "… electronic devices, solar cells that can be … dye-sensitized solar cells (FDSSC), which\nmerge the advantages of flexible fiber electronics and high-efficiency dye-sensitized solar cells (…", "key": "dye sensitized solar cells_3_1664170640059"}, {"title": "Improving of the Photovoltaic Characteristics of Dye-Sensitized Solar Cells Using a Photoelectrode with Electrospun Porous TiO2 Nanofibers", "link": "https://www.mdpi.com/394302", "abstract": "Porous TiO 2 nanofibers (PTFs) and dense TiO 2 nanofibers (DTFs) were prepared using\nsimple electrospinning for application in dye-sensitized solar cells (DSSCs). TiO 2 …", "key": "dye sensitized solar cells_3_1664170640059"}, {"title": "Long-term stable solid-state dye-sensitized solar cells assembled with solid-state polymerized hole-transporting material", "link": "https://www.mdpi.com/524932", "abstract": "The long-term stability of liquid-state dye-sensitized solar cells (liquid-DSSCs) is a primary\nproblem for the upscaling and commercialization of this technology. The solid-state dye-…", "key": "dye sensitized solar cells_3_1664170640059"}, {"title": "An equivalent circuit for perovskite solar cell bridging sensitized to thin film architectures", "link": "https://www.sciencedirect.com/science/article/pii/S2542435119303587", "abstract": "… More than a decade ago, a new family of light sensitizers, the quantum dots (QDs), experienced\nan increase of performance and popularity among the dye-sensitized solar cell (DSSC) …", "key": "dye sensitized solar cells_4_1664171468033"}, {"title": "Recent progress in quantum dot sensitized solar cells: an inclusive review of photoanode, sensitizer, electrolyte, and the counter electrode", "link": "https://pubs.rsc.org/en/content/articlehtml/2019/tc/c8tc06476h", "abstract": "… solar cells, fuel cells, batteries, and supercapacitors; in the last few decades, quantum dot-sensitized\nsolar cells … perceived benefits over some alternative solar cells in terms of high light, …", "key": "dye sensitized solar cells_4_1664171468033"}, {"title": "Improved CdS quantum dot distribution on a TiO2 photoanode by an atomic-layer-deposited ZnS passivation layer for quantum dot-sensitized solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S0927024820303524", "abstract": "… the performance of CdS quantum-dot (QD) sensitized solar cells. The mutable role of the\ntop ZnS IPL, deposited after QD sensitization, enhanced light absorbance by acting as an anti-…", "key": "dye sensitized solar cells_4_1664171468033"}, {"title": "Solar cells for indoor applications: progress and development", "link": "https://www.mdpi.com/741494", "abstract": "… This study discusses the current status of the development of indoor PV cells based on …\nregarding indoor solar cells based on different active materials such as inorganic, dye-sensitized, …", "key": "dye sensitized solar cells_4_1664171468033"}, {"title": "Effect of additional phenothiazine donor and thiophene π-bridge on photovoltaic performance of quinoxaline cored photosensitizers", "link": "https://www.sciencedirect.com/science/article/pii/S0143720819308174", "abstract": "A series of quinoxaline-based sensitizers were designed through the elongation of π-\nconjugation length based on the sense of directional electron transport from donor to …", "key": "Electrochemical impedance spec cited by_1_16637666"}, {"title": "Incorporation of Nanostructured Carbon Composite Materials into Counter Electrodes for Highly Efficient Dye-Sensitized Solar Cells", "link": "https://nanoscalereslett.springeropen.com/articles/10.1186/s11671-018-2692-1", "abstract": "Dye-sensitized solar cells (DSSCs) composed of nanostructured carbon composite\nmaterials-stacked counter electrodes (CEs) were fabricated in the present study. As the …", "key": "Electrochemical impedance spec cited by_1_16637668"}, {"title": "Improvement of light scattering capacity in dye-sensitized solar cells by doping with SiO2 nanoparticles", "link": "https://www.sciencedirect.com/science/article/pii/S0378775316308886", "abstract": "N-doped TiO 2 was further doped with SiO 2 to prepare SiO 2/N-doped TiO 2\nphotoelectrodes with high activity in the visible region. A sol-gel process was employed to …", "key": "Electrochemical impedance spec cited by_1_16637783"}, {"title": "Photovoltaic performance of dye-sensitized solar cells containing ZnO microrods", "link": "https://www.mdpi.com/577544", "abstract": "At an elevated temperature of 90° C, a chemical bath deposition using an aqueous solution\nof Zn (NO3) 2· 6H2O and (CH2) 6N4 resulted in the formation of both nanoflowers and …", "key": "Electrochemical impedance spec cited by_8_16637797"}, {"title": "High-performance CH3NH3PbI3 inverted planar perovskite solar cells via ammonium halide additives", "link": "https://www.sciencedirect.com/science/article/pii/S1226086X19304071", "abstract": "Organic-inorganic hybrid perovskites have recently attracted substantial attention as a top\ncandidate for use as light-absorbing materials in high-efficiency, low-cost and solution …", "key": "Electrochemical impedance spec cited by_8_16637797"}, {"title": "Enhancement of solar cell performance through the formation of a surface dipole on polyacrylonitrile-treated TiO2 photoelectrodes", "link": "https://www.sciencedirect.com/science/article/pii/S1226086X18310189", "abstract": "Polyacrylonitrile (PAN) was adsorbed onto the TiO 2 surface, and the resulting\nphotoelectrodes were applied in dye-sensitized solar cells (DSSCs). The DSSC with the …", "key": "Electrochemical impedance spec cited by_8_16637797"}, {"title": "Effects of a TiO2: CaO barrier layer on the back electron transfer in TiO2-based solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S1226086X17300618", "abstract": "A TiO 2: CaO mixed overlayer was formed on TiO 2 photoelectrodes, and the resulting\nphotoelectrodes were applied to dye-sensitized solar cells (DSSCs). DSSC with the mixed …", "key": "Electrochemical impedance spec cited by_8_16637797"}, {"title": "Effects of a dianion compound as a surface modifier on the back reaction of photogenerated electrons in TiO2-based solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S1878535218301060", "abstract": "The TiO 2 films were modified with a dianion compound, 1, 2-ethanedisulfonic acid disodium\nsalt (ESD), to give a negative charge (ethane sulfonate anion) on the TiO 2 surface, ie, TiO 2 …", "key": "Electrochemical impedance spec cited by_8_16637797"}, {"title": "A comparative study of Be and Mg ions adsorbed on TiO2 photoelectrodes on interfacial charge recombination in solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S1226086X1830203X", "abstract": "Abstract Be 2+ and Mg 2+ ions were adsorbed on a TiO 2 surface, and the resulting\nphotoelectrodes were applied in dye-sensitized solar cells. Be 2+ modification led to an …", "key": "Electrochemical impedance spec cited by_8_16637797"}, {"title": "Improvement in photovoltaic efficiency of solar cells with ZnO nanorods and electrophoretically-adsorbed dyes", "link": "https://www.tandfonline.com/doi/abs/10.1080/15421406.2021.1972232", "abstract": "ZnO nanorods grown on the F-doped tin oxide glass by a chemical bath deposition were\nsensitized by the electrophoretic technique or the conventional soaking method, and the …", "key": "Electrochemical impedance spec cited by_8_16637797"}, {"title": "Effects of Deposition Method of Thermally Decomposed Platinum Counter Electrodes on the Performance of Dye-Sensitized Solar Cells", "link": "https://www.koreascience.or.kr/article/JAKO201707457888081.page", "abstract": "In this work, two different platinum (Pt) counter electrodes have been prepared by spin\ncoating a Pt solution and screen printing a Pt paste on fluorine doped tin oxide (FTO) glass …", "key": "Electrochemical impedance spec cited by_8_16637797"}, {"title": "Design principles and developments of integrated solar flow batteries", "link": "https://pubs.acs.org/doi/abs/10.1021/acs.accounts.0c00373", "abstract": "… Conventional round-trip solar energy utilization systems typically rely on the combination of\n… Integrated solar flow batteries (SFBs) are a new type of device that integrates solar energy …", "key": "integrated solar batteries_1_1663780832943"}, {"title": "An Analysis of the Promise of Li–O2 and Li–S Batteries Incorporating Plasmonic Metal Nanostructures", "link": "https://www.sciencedirect.com/science/article/pii/S2468606922000910", "abstract": "… The proposed strategy aligns with the rising interest in integrated solar energy harvesting\nin battery systems. Here, we consider two representative candidates, Li–S and Li–O 2 , for …", "key": "integrated solar batteries_1_1663780896368"}, {"title": "HESS-based photovoltaic/batteries/supercapacitors: Energy management strategy and DC bus voltage stabilization", "link": "https://www.sciencedirect.com/science/article/pii/S0038092X21000645", "abstract": "… reference current of batteries and SCs. The distribution of energy between batteries and\nSCs is based on a low pass filter in order to eliminate the peak current on batteries and send it …", "key": "integrated solar batteries_1_1663781116114"}, {"title": "Energy Spotlight: Advances in Tin Halide Perovskite Solar Cells, Electrocatalytic CO2 Reduction and Lithium−Air Batteries", "link": "https://pubs.acs.org/doi/full/10.1021/acsenergylett.0c01358", "abstract": "… high-performance Li–O 2 batteries. They integrated a solvating solvent and a diluent solvent\n… enhanced the performance of Li–O 2 batteries. The authors confirmed that LHCEs with an …", "key": "integrated solar batteries_1_1663781269718"}, {"title": "… of iron doped cobalt-vanadate-cobalt oxide with metal-organic framework oriented nanoflakes for portable rechargeable zinc-air batteries powered total water splitting", "link": "https://www.sciencedirect.com/science/article/pii/S2211285521004936", "abstract": "… solar and batteries and water-splitting system.[5] In specific, high-energy and very cheap\nZn-air batteries were … and reliable activity of our self-integrated zinc-air battery devise to record …", "key": "integrated solar batteries_1_1663781396898"}, {"title": "Economic and environmental feasibility of second-life lithium-ion batteries as fast-charging energy storage", "link": "https://pubs.acs.org/doi/abs/10.1021/acs.est.9b05883", "abstract": "… in all configurations considered compared to new batteries. Due to the large differences\nin electricity prices, carbon intensity of the grid, and solar insolation for the five locations, the …", "key": "integrated solar batteries_1_1663781794117"}, {"title": "Waste pig blood-derived 2D Fe single-atom porous carbon as an efficient electrocatalyst for zinc–air batteries and AEMFCs", "link": "https://www.sciencedirect.com/science/article/pii/S0169433221012848", "abstract": "… integrated as an Anion Exchange Membrane Fuel Cells (AEMFCs) and Zn‐Air Batteries (…\nZn/Fe SA -PC catalysts developed here are applicable in both AEMFC and Zn-Air batteries. …", "key": "integrated solar batteries_1_1663782048167"}, {"title": "Review on the production of high-purity lithium metal", "link": "https://pubs.rsc.org/en/content/articlehtml/2020/ta/d0ta07611b", "abstract": "… batteries (LIBs), ie, the state-of-the-art rechargeable batteries, … elegant method, which\nintegrated solar cells and electrolytic … Namely, the solar cells converted solar energy into electricity …", "key": "integrated solar batteries_1_1663782221450"}, {"title": "Sustainable wearable energy storage devices self‐charged by human‐body bioenergy", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/sus2.14", "abstract": "… Fibers/yarns shape TENGs and batteries are more flexible and can be integrated into …\nthree fiber-shaped dye-sensitized solar cells (DSSCs) are integrated on a bracelet. The rectified …", "key": "integrated solar batteries_1_1663783061411"}, {"title": "Synergistic Catalysis of the Lattice Oxygen and Transition Metal Facilitating ORR and OER in Perovskite Catalysts for Li–O2 Batteries", "link": "https://pubs.acs.org/doi/abs/10.1021/acscatal.0c02608", "abstract": "… batteries by comparing H-ORR in aqueous solutions and Li-ORR in aprotic solutions using\nintegrated … ) for catalyzing ORR in aprotic Li–O 2 batteries. To the best of our knowledge, this …", "key": "integrated solar batteries_2_1663781720608"}, {"title": "An analysis of battery degradation in the integrated energy storage system with solar photovoltaic generation", "link": "https://www.mdpi.com/700094", "abstract": "… The battery type is LFP which has a higher charge and discharge cycle with an excellent\nelectrochemical performance than other types such as Li-ion and lead–acid batteries [46]. Due …", "key": "integrated solar batteries_2_1663781720608"}, {"title": "Silicon and porous MWCNT composite as high capacity anode for lithium-ion batteries", "link": "https://link.springer.com/article/10.1007/s11814-020-0559-5", "abstract": "… The obtained composite, which was studied as an anode for Li-ion batteries, exhibited\nexcellent cyclability and superior rate capability compared with pristine silicon nanoparticles. The …", "key": "integrated solar batteries_3_1663782511944"}, {"title": "Miniature microbial solar cells to power wireless sensor networks", "link": "https://www.sciencedirect.com/science/article/pii/S0956566321000063", "abstract": "… ) powered by traditional batteries or energy storage devices such as lithium-ion batteries and\n… Our group integrated, for the first time, these mixed microbial communities into a miniature …", "key": "integrated solar batteries_3_1663782511944"}, {"title": "Development of optimal energy management for a residential fuel cell hybrid power system with heat recovery", "link": "https://www.sciencedirect.com/science/article/pii/S0360544220326062", "abstract": "… turbines, solar panels, super-capacitor, and batteries [4,5]. … cell waste heat in an integrated\nsystem, thereby increasing … power between fuel cells and batteries. This system ensures the …", "key": "integrated solar batteries_3_1663782511944"}, {"title": "Solar-Powered Supercapacitors Integrated with a Shared Electrode", "link": "https://pubs.acs.org/doi/abs/10.1021/acsaem.1c02813", "abstract": "… (5,6) In a frequently used SPIS configuration, a supercapacitor (SC) is integrated with an\norganic solar cell (OSC) into one unit that stores the electric energy produced by the solar …", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Rational design of nanostructured electrode materials toward multifunctional supercapacitors", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adfm.201902564", "abstract": "… integrating supercapacitors with other applications have led to the emergence of many new\ntypes of multifunctional supercapacitors… supercapacitors like flexible supercapacitors, all-solid…", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Mineralized soft and elastic polymer dot hydrogel for a flexible self-powered electronic skin sensor", "link": "https://pubs.acs.org/doi/abs/10.1021/acsami.0c08677", "abstract": "… of the PCLA hydrogel, we fabricated an integrated supercapacitor using this hydrogel as an\n… After the solar cell was integrated into the supercapacitor unit, the efficiency of the solar cell …", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Miniature microbial solar cells to power wireless sensor networks", "link": "https://www.sciencedirect.com/science/article/pii/S0956566321000063", "abstract": "… , integration of supercapacitor for simultaneous energy storage, paper-based device\nplatforms, and many other alternative ideas using nanomaterials and stacking. However, some …", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Vertical all-in-one energy systems constructed with thermoelectric generators and microsupercapacitors", "link": "https://www.sciencedirect.com/science/article/pii/S0378775321009101", "abstract": "… efficiency of solar cells in the all-in-one energy systems is debased by integrating energy-…\n-one energy systems comprising only supercapacitors that generate thermovoltage induced …", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Flexible solid-state hybrid supercapacitors for the internet of everything (IoE)", "link": "https://pubs.rsc.org/en/content/articlehtml/2022/ee/d1ee03567c", "abstract": "… solar cell demonstrated excellent integration performance, which can be utilized in solar\ncells and customized low-power boosters even under weak sunlight, as shown in Fig. 11(h). …", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Fully stretchable self-charging power unit with micro-supercapacitor and triboelectric nanogenerator based on oxidized single-walled carbon nanotube/polymer …", "link": "https://www.sciencedirect.com/science/article/pii/S2211285521003402", "abstract": "… , integrated self-powering units, which combine triboelectric nanogenerators (TENGs) and\nmicro-supercapacitors (… TENGs integrated in wearable electronics generate electricity from …", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Imperceptible Supercapacitors with High Area‐Specific Capacitance", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smll.202101704", "abstract": "… supercapacitors in a crumpling test which induced wrinkles with radii of 6 µm or less. We\nbelieve that our imperceptible supercapacitors, … in future integrated imperceptible electronics. …", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Study on the Integral Compensator Using Supercapacitor for Energy Harvesting in Low-Power Sections of Solar Energy", "link": "https://www.mdpi.com/1996-1073/14/8/2262", "abstract": "… It was also confirmed, through SOC measurement, that the charging method of using the\nsupercapacitor integration controller stored 6% more energy than the normal charging method. …", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Carbon nanotube yarn for fiber‐shaped electrical sensors, actuators, and energy storage for smart systems", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adma.201902670", "abstract": "… For example, the integration of supercapacitors with energy harvesters has been developed\n… -wire composite CNT solar cells (4.23%).101 In addition, the efficiency of CNT solar cell was …", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Carbon nanotube yarn for fiber‐shaped electrical sensors, actuators, and energy storage for smart systems", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adma.201902670", "abstract": "… For example, the integration of supercapacitors with energy harvesters has been developed\n… -wire composite CNT solar cells (4.23%).101 In addition, the efficiency of CNT solar cell was …", "key": "integrated solar cells and supercapacitors_1_16638"}, {"title": "Recent Development of Flexible and Stretchable Supercapacitors Using Transition Metal Compounds as Electrode Materials", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smll.202101974", "abstract": "… Flexible and stretchable supercapacitors (FS-SCs) are … Integrated systems that combine\nwearable electronics with … can be prepared by integrating manganese oxides with conductive …", "key": "integrated solar cells and supercapacitors_1_16639"}, {"title": "Ultra-lightweight, flexible InGaP/GaAs tandem solar cells with a dual-function encapsulation layer", "link": "https://pubs.acs.org/doi/abs/10.1021/acsami.1c00006", "abstract": "… In particular, this bonding layer was integrated into our solar cell structure as the back Ohmic\ncontact to facilitate an additional reduction in PV cost. In addition, we have developed an …", "key": "integrated solar cells and supercapacitors_1_16639"}, {"title": "Rational design of electrochemical iodine-based redox mediators for water-proofed flexible fiber supercapacitors", "link": "https://pubs.acs.org/doi/abs/10.1021/acssuschemeng.9b06164", "abstract": "… system (f-FESS) integrated with iodine-based chemical … charge storage capability of flexible\nsupercapacitors. The as-prepared f… strong mechanical robustness in flexible supercapacitors. …", "key": "integrated solar cells and supercapacitors_1_16639"}, {"title": "Quantum dot synthesis from waste biomass and its applications in energy and bioremediation", "link": "https://www.sciencedirect.com/science/article/pii/S0045653522000534", "abstract": "… in efficiency of solar cells and photovoltaics due to the integration of QDs. Supercapacitors:\n… improved for storage capacity and introduce supercapacitors (SC) with high energy density (>…", "key": "integrated solar cells and supercapacitors_1_16639"}, {"title": "A fractal-designed stretchable and transparent microsupercapacitor as a skin-attachable energy storage device", "link": "https://www.sciencedirect.com/science/article/pii/S138589472030067X", "abstract": "… supercapacitor, the proper materials for efficient electrodes and stretchable structures must\nbe cautiously selected. Stretchable supercapacitors … TS MSC as an integrated energy storage …", "key": "integrated solar cells and supercapacitors_1_16639"}, {"title": "0D to 3D carbon-based networks combined with pseudocapacitive electrode material for high energy density supercapacitor: A review", "link": "https://www.sciencedirect.com/science/article/pii/S1385894720324803", "abstract": "… in supercapacitor apart from their extensive study in solar cells, light emitting diodes (LEDs),\nsingle-electron transistors and lasers. Graphene quantum dots (GQDs) are the single or few …", "key": "integrated solar cells and supercapacitors_1_16639"}, {"title": "High-Voltage and Green-Emitting Perovskite Quantum Dot Solar Cells via Solvent Miscibility-Induced Solid-State Ligand Exchange", "link": "https://pubs.acs.org/doi/abs/10.1021/acs.chemmater.0c02102", "abstract": "… on CsPbBr 3 perovskite solar cells have been conducted … been utilized in CsPbBr 3\nsolar cells exhibiting a PCE of 5.42… V OC and colorful building-integrated photovoltaics (BIPVs) …", "key": "integrated solar cells and supercapacitors_1_16639"}, {"title": "Burst-transfer boost charger for supercapacitors from subwatt-scale harvesting sources", "link": "https://www.sciencedirect.com/science/article/pii/S0378775321012362", "abstract": "… supercapacitors under low-power supply conditions by examining the equivalent circuit model\nand leakage characteristics of supercapacitors. … solar cell for our validation of BurstCap. …", "key": "integrated solar cells and supercapacitors_1_16639"}, {"title": "Fabrication of integrated device comprising flexible dye-sensitized solar cell and graphene-doped supercapacitor", "link": "https://sensors.myu-group.co.jp/sm_pdf/SM2241.pdf", "abstract": "… Flexible supercapacitors have a long cycle life, … supercapacitor was prepared using activated\ncarbon doped with graphene and was integrated with a flexible dye-sensitized solar cell (…", "key": "integrated solar cells and supercapacitors_2_16638"}, {"title": "Electrochemical supercapacitors: from mechanism understanding to multifunctional applications", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/aenm.202003311", "abstract": "… In this section, integration of SCs with solar cells, piezo-, tribo-, and thermo-electric devices\n… Solar cells can only convert solar energy into electric energy during daytime, thus integration …", "key": "integrated solar cells and supercapacitors_2_16638"}, {"title": "Design and simulation studies of battery-supercapacitor hybrid energy storage system for improved performances of traction system of solar vehicle", "link": "https://www.sciencedirect.com/science/article/pii/S2352152X20317795", "abstract": "… This study presents the impact of the integration of SCs in the energy storage of the solar\nvehicle. However, this implementation of SCs have a good impact to the SV internes of …", "key": "integrated solar cells and supercapacitors_2_16638"}, {"title": "Self-repairable and recyclable self-powered human motion sensor with NIR/pH-responsive amplified Stretchable, Conductive, and Self-Healable hydrogel", "link": "https://www.sciencedirect.com/science/article/pii/S1385894721034239", "abstract": "… To integrate the solar cell on the top of the supercapacitor unit, a small quantity of Ag paste\n… electrodes and the supercapacitor unit was stacked with the solar cell using gentle pressure. …", "key": "integrated solar cells and supercapacitors_2_16638"}, {"title": "Electrode materials for biomedical patchable and implantable energy storage devices", "link": "https://www.sciencedirect.com/science/article/pii/S2405829719301631", "abstract": "… The system integrated a solar cell for energy harvesting with an SC for energy storage. The\nIEMDs were assembled into two biocompatible electrodes: MnO 2 NPs affixed to MWCNTs …", "key": "integrated solar cells and supercapacitors_2_16638"}, {"title": "Efficiency improvement of indoor organic solar cell by optimization of the doping level of the hole extraction layer", "link": "https://www.sciencedirect.com/science/article/pii/S0143720820314169", "abstract": "… acceptability of organic IPV devices, further research is needed to achieve their integrated\nuse. In an organic IPV cell, the hole extraction layer (HEL) is an important component used to …", "key": "integrated solar cells and supercapacitors_2_16638"}, {"title": "Nanostructured CeO2/NiV–LDH composite for energy storage in asymmetric supercapacitor and as methanol oxidation electrocatalyst", "link": "https://www.sciencedirect.com/science/article/pii/S1385894720341371", "abstract": "… fabricated supercapacitor device. Herein, a novel quasi-solid-state asymmetric supercapacitor\n(… improved electrochemical feature from synergistic integration between high surface area …", "key": "integrated solar cells and supercapacitors_2_16639"}, {"title": "“Waste to wealth”: lignin as a renewable building block for energy harvesting/storage and environmental remediation", "link": "https://chemistry-europe.onlinelibrary.wiley.com/doi/abs/10.1002/cssc.202000394", "abstract": "… in lignin processing, integration, and applications in the … We then focus on the fabrication of\nsupercapacitors and lithium-… A dye-sensitized solar cell (DSSC) is a type of low-cost PV cell …", "key": "integrated solar cells and supercapacitors_2_16639"}, {"title": "Nanostructured CeO2/NiV–LDH composite for energy storage in asymmetric supercapacitor and as methanol oxidation electrocatalyst", "link": "https://www.sciencedirect.com/science/article/pii/S1385894720341371", "abstract": "… fabricated supercapacitor device. Herein, a novel quasi-solid-state asymmetric supercapacitor\n(… improved electrochemical feature from synergistic integration between high surface area …", "key": "integrated solar cells and supercapacitors_2_16639"}, {"title": "“Waste to wealth”: lignin as a renewable building block for energy harvesting/storage and environmental remediation", "link": "https://chemistry-europe.onlinelibrary.wiley.com/doi/abs/10.1002/cssc.202000394", "abstract": "… in lignin processing, integration, and applications in the … We then focus on the fabrication of\nsupercapacitors and lithium-… A dye-sensitized solar cell (DSSC) is a type of low-cost PV cell …", "key": "integrated solar cells and supercapacitors_2_16639"}, {"title": "Agarose Gel-Templating Synthesis of a 3D Wrinkled Graphene Architecture for Enhanced Supercapacitor Performance", "link": "https://www.mdpi.com/2072-666X/13/7/1113", "abstract": "… energy storage units are especially important for integrating energy conversion devices (such\nas piezoelectric nanogenerators, solar cells, or thermoelectric cells) to build self-powered …", "key": "integrated solar cells and supercapacitors_2_16639"}, {"title": "Voltage-tunable portable power supplies based on tailored integration of modularized silicon photovoltaics and printed bipolar lithium-ion batteries", "link": "https://pubs.rsc.org/en/content/articlehtml/2020/ta/d0ta04843g", "abstract": "… Coupling solar cells with … (or supercapacitors) are insufficient and the photoelectric-conversion/storage\nefficiency (ie, overall efficiency) is much lower than those of physically integrated …", "key": "integrated solar cells and supercapacitors_2_16639"}, {"title": "Mesostructured g-C3N4 nanosheets interconnected with V2O5 nanobelts as electrode for coin-cell-type-asymmetric supercapacitor device", "link": "https://www.sciencedirect.com/science/article/pii/S2468606921000642", "abstract": "In this study, low-cost, noble-metal-free, ecologically friendly, high-performance coin-cell-type\nsupercapacitors are constructed using an efficient one-pot approach. Two novel …", "key": "integrated solar cells and supercapacitors_2_16639"}, {"title": "Recent advances in fiber-shaped electronic devices for wearable applications", "link": "https://www.mdpi.com/1172920", "abstract": "… , fiber-shaped supercapacitors (or batteries) can be integrated with fibriform solar cells (or …\nAlthough the integration of electronic fibers has mainly been achieved through weaving, …", "key": "integrated solar cells and supercapacitors_2_16639"}, {"title": "A unique core–shell structured ZnO/NiO heterojunction to improve the performance of supercapacitors produced using a chemical bath deposition approach", "link": "https://pubs.rsc.org/en/content/articlehtml/2020/dt/d0dt00263a", "abstract": "… integration of metal oxide composite nanostructures has attracted great attention in supercapacitor\n… for various applications including flat panel displays, solar cells, light-emitting diodes, …", "key": "integrated solar cells and supercapacitors_2_16639"}, {"title": "PEDOT:PSS/MnO2/CNT Ternary Nanocomposite Anodes for Supercapacitive Energy Storage in Cyanobacterial Biophotovoltaics", "link": "https://pubs.acs.org/doi/abs/10.1021/acsaem.0c02054", "abstract": "… experimental setting, it actually integrated into a practical cyanobacterial biophotovoltaic\ndevice … The integration of the internal supercapacitor within the cyanobacterial biophotovoltaics …", "key": "integrated solar cells and supercapacitors_2_16639"}, {"title": "A multifunctional TiN/Ni electrode for wearable supercapacitor and sensor with an insight into charge storage mechanism", "link": "https://www.sciencedirect.com/science/article/pii/S0169433221007947", "abstract": "… As a result, the supercapacitors are favored as a power … supercapacitors in wearable devices\nremains a challenge due to the energy density limitations. In addition to the supercapacitors…", "key": "integrated solar cells and supercapacitors_3_16639"}, {"title": "N-doped hierarchical porous hollow carbon nanofibers based on PAN/PVP@ SAN structure for high performance supercapacitor", "link": "https://www.sciencedirect.com/science/article/pii/S1359836819351145", "abstract": "… to the capacitance of supercapacitor and lithium ion battery, was … % were observed to decrease\nthe integrated areas within the CV … in fabricating electrode materials for supercapacitors. …", "key": "integrated solar cells and supercapacitors_3_16639"}, {"title": "B/N-doped graphdiyne as superior supercapacitor electrode with record high quantum capacitance", "link": "https://www.sciencedirect.com/science/article/pii/S0169433220312253", "abstract": "… For practical applications of supercapacitors, one crucial … the integrated value over a complete\ncharging/discharging cycle [19]. To explore the capacity, we also calculated the integrated …", "key": "integrated solar cells and supercapacitors_3_16639"}, {"title": "6.16% efficiency of solid-state fiber dye-sensitized solar cells based on LiTFSI electrolytes with novel TEMPOL derivatives", "link": "https://pubs.acs.org/doi/abs/10.1021/acssuschemeng.0c05427", "abstract": "Dye-sensitized solar cells (DSSCs) have attracted intense scientific interest due to their low\ncost, environmentally friendly operation, and relatively high efficiency. In particular, solid …", "key": "On the hysteresis of current d cited by_1_16637793"}, {"title": "Development of perovskite solar cells with> 25% conversion efficiency", "link": "https://www.sciencedirect.com/science/article/pii/S254243512100194X", "abstract": "… transfer and the perovskite layer are key for achieving high-efficiency perovskite solar\ncells. … In recent years, perovskite solar cells (PSCs), which are based on an organic-inorganic …", "key": "perovskite solar cells_1_1664172623592"}, {"title": "The high open-circuit voltage of perovskite solar cells: a review", "link": "https://pubs.rsc.org/en/content/articlehtml/2021/xx/d2ee00663d", "abstract": "… Perovskite solar cells (PSCs) have made incredibly fast … to those of the best silicon solar\ncells. One of the features of PSCs that … photovoltaics and dye-sensitized solar cells, and vacuum-…", "key": "perovskite solar cells_1_1664172810637"}, {"title": "Perovskite solar cells with atomically coherent interlayers on SnO2 electrodes", "link": "https://www.nature.com/articles/s41586-021-03964-8", "abstract": "… perovskite solar cells, the interfaces between the perovskite and charge-transporting layers\ncontain high concentrations of defects (about 100 times that within the perovskite … perovskite …", "key": "perovskite solar cells_1_1664172913734"}, {"title": "Control of crystal growth toward scalable fabrication of perovskite solar cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adfm.201807047", "abstract": "… solar modules. Herein, this paper reports on the … -area perovskite solar cells. A deeper\nunderstanding of the crystallization of perovskite films is indeed essential for large-area perovskite …", "key": "perovskite solar cells_1_1664172942675"}, {"title": "Recent advancements in and perspectives on flexible hybrid perovskite solar cells", "link": "https://pubs.rsc.org/en/content/articlehtml/2021/xx/c8ta09452g", "abstract": "… perovskite solar cells such as single junction rigid and flexible devices and tandem devices;\nand perovskite … on perovskite solar cells and high-performing perovskite photodetectors. …", "key": "perovskite solar cells_1_1664173851258"}, {"title": "A Short Review on Interface Engineering of Perovskite Solar Cells: A Self‐Assembled Monolayer and Its Roles", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/solr.201900251", "abstract": "… cells,6, 7 and perovskite cells having been developed in recent years.8, 9 Among these newer\ncells, perovskite solar cells … This PCE is comparable with that of other solar cell types such …", "key": "perovskite solar cells_1_1664173894723"}, {"title": "Boosting the Stability of Fully-Inorganic Perovskite Solar Cells through Samarium Doped CsPbI2Br Perovskite", "link": "https://pubs.acs.org/doi/abs/10.1021/acssuschemeng.0c06452", "abstract": "… hybrid perovskite because of the boosted efficiency and stability of perovskite solar cells (PVSC…\nas well as grain boundary passivating perovskite by a simple hot air method for inorganic …", "key": "perovskite solar cells_1_1664174441683"}, {"title": "Intact 2D/3D halide junction perovskite solar cells via solid-phase in-plane growth", "link": "https://www.nature.com/articles/s41560-020-00749-7", "abstract": "… (2D/3D) halide perovskite bilayers in perovskite solar cells for improving the efficiency and\n… due to the formation of a metastable quasi-2D perovskite. Here we grow a stable and highly …", "key": "perovskite solar cells_1_1664174516640"}, {"title": "Hot-Air-Assisted Fully Air-Processed Barium Incorporated CsPbI2Br Perovskite Thin Films for Highly Efficient and Stable All-Inorganic Perovskite Solar Cells", "link": "https://pubs.acs.org/doi/abs/10.1021/acs.nanolett.9b02277", "abstract": "… thermally stable inorganic cations in perovskite solar cells (PSCs) is one … Furthermore, CsPbI\n2 Br perovskite was doped with barium (… The DHA-processed BaI 2 :CsPbI 2 Br perovskite …", "key": "perovskite solar cells_1_1664174640643"}, {"title": "Achieving Reproducible and High-Efficiency (>21%) Perovskite Solar Cells with a Presynthesized FAPbI3 Powder", "link": "https://pubs.acs.org/doi/abs/10.1021/acsenergylett.9b02348", "abstract": "… 99.99%) is problematic in commercializing perovskite solar cells (PSCs) because of a large\n… Hybrid organic–inorganic all-solid-state perovskite solar cells (PSCs) are currently attracting …", "key": "perovskite solar cells_1_1664174689802"}, {"title": "VOC Over 1.4 V for Amorphous Tin-Oxide-Based Dopant-Free CsPbI2Br Perovskite Solar Cells", "link": "https://pubs.acs.org/doi/abs/10.1021/jacs.0c02227", "abstract": "… CsPbI 2 Br perovskite solar cells have attracted much attention … cell of tandem solar cells.\nHowever, the V OC outputs observed so far in most cases are far from that desired for a top cell. …", "key": "perovskite solar cells_1_1664174724680"}, {"title": "Origins of high performance and degradation in the mixed perovskite solar cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adma.201805438", "abstract": "… of perovskite solar cells. Here this study investigates the possible origins of the mixed perovskite\ncells by monitoring defect states and compositional changes of the perovskite layer over …", "key": "perovskite solar cells_1_1664174877995"}, {"title": "Ultrathin, lightweight and flexible perovskite solar cells with an excellent power-per-weight performance", "link": "https://pubs.rsc.org/en/content/articlehtml/2018/ta/c8ta10585e", "abstract": "… This study aims to demonstrate ultralight and flexible perovskite solar cells (PSCs) with … the\nhighest value reported for a lightweight solar cell device. These lightweight energy harvesting …", "key": "perovskite solar cells_1_1664174915505"}, {"title": "Effect of Interfacial Layers on the Device Lifetime of Perovskite Solar Cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smtd.202000065", "abstract": "… This section presents various inorganic HTLs and ETLs for perovskite solar cells. In\nparticular, the influences of the inorganic transport layer on robustness and low-temperature …", "key": "perovskite solar cells_1_1664174999653"}, {"title": "Enhanced moisture stability by butyldimethylsulfonium cation in perovskite solar cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/advs.201901840", "abstract": "… cations in halide perovskites have been studied for their application in perovskite solar cells\n(PSCs). … The BDMS-based perovskites retain the structural and optical features of pristine …", "key": "perovskite solar cells_1_1664175044547"}, {"title": "Stable perovskite solar cells using tin acetylacetonate based electron transporting layers", "link": "https://pubs.rsc.org/en/content/articlehtml/2019/ee/c9ee00453j", "abstract": "… Ultimately, we confirm the importance of surface passivation for SnO 2 , specifically for\nperovskite solar cell applications due to its metal-like nature. Cl 2 and Br 2 are proved to provide …", "key": "perovskite solar cells_1_1664175128080"}, {"title": "Recent progress in inorganic hole transport materials for efficient and stable perovskite solar cells", "link": "https://link.springer.com/article/10.1007/s13391-019-00163-6", "abstract": "… Schematic of a semi-transparent p-i-n type Cs 0.17 FA 0.83 Pb(Br 0.17 I 0.83 ) 3 perovskite\nsolar cell (not to scale), and J–V curve with steady-state efficiency of the perovskite solar cell …", "key": "perovskite solar cells_1_1664175274568"}, {"title": "Stable and reproducible 2D/3D formamidinium–lead–iodide perovskite solar cells", "link": "https://pubs.acs.org/doi/abs/10.1021/acsaem.8b01964", "abstract": "… 2D perovskite-stabilized FACsPbI 3 (FA = formamidinium) perovskite solar cells were …\nformation on the perovskite films during a spin-coating process. The hardness of both the …", "key": "perovskite solar cells_1_1664175376545"}, {"title": "Sn perovskite solar cells via 2D/3D bilayer formation through a sequential vapor process", "link": "https://pubs.acs.org/doi/abs/10.1021/acsenergylett.0c01887", "abstract": "… Sn-based perovskite solar cells are … perovskite solar cells. The main challenges lie in\nimproving the oxidation stability and ensuring a uniform morphology of the Sn-based perovskite …", "key": "perovskite solar cells_1_1664175460547"}, {"title": "High-efficiency perovskite solar cells", "link": "https://pubs.acs.org/doi/abs/10.1021/acs.chemrev.0c00107", "abstract": "… Triggered by the development of the solid-state perovskite solar cell in 2012, intense follow-…\nsolid-state perovskite solar cell to be a strong candidate for a next-generation solar energy …", "key": "perovskite solar cells_2_1664172537952"}, {"title": "Stable perovskite solar cells with efficiency exceeding 24.8% and 0.3-V voltage loss", "link": "https://www.science.org/doi/abs/10.1126/science.abb7167", "abstract": "… as a hole-transporting material for perovskite solar cells requires the use of hygroscopic …\nfor hole extraction and used them to fabricate perovskite solar cells. A champion device had a …", "key": "perovskite solar cells_2_1664172537952"}, {"title": "Historical Analysis of High‐Efficiency, Large‐Area Solar Cells: Toward Upscaling of Perovskite Solar Cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adma.202002202", "abstract": "… 2 perovskite solar module has been reported with 17.9% efficiency, which is significantly\nlower than the champion perovskite solar cell … high-quality perovskite solar cells, the upscaling …", "key": "perovskite solar cells_2_1664172701768"}, {"title": "Efficient, stable and scalable perovskite solar cells using poly (3-hexylthiophene)", "link": "https://www.nature.com/articles/s41586-019-1036-3", "abstract": "… the efficiencies of perovskite solar cells using P3HT … perovskite solar cells that use P3HT\nas a hole-transport material without any dopants. A thin layer of wide-bandgap halide perovskite …", "key": "perovskite solar cells_2_1664172701768"}, {"title": "Impact of strain relaxation on performance of α-formamidinium lead iodide perovskite solar cells", "link": "https://www.science.org/doi/abs/10.1126/science.abc4417", "abstract": "… High-efficiency lead halide perovskite solar cells (PSCs) have … The lead halide perovskite\nstructure is represented by the … perovskite structure. The optoelectrical properties of APbX 3 …", "key": "perovskite solar cells_2_1664172774723"}, {"title": "Present Status and Research Prospects of Tin‐based Perovskite Solar Cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/solr.201900310", "abstract": "… future generation of Pb-free perovskite solar cells is highly linked with imitating the footsteps\nof high-performance Pb-based perovskite solar cells. High photovoltaic performances for …", "key": "perovskite solar cells_2_1664172774723"}, {"title": "Self‐crystallized multifunctional 2D perovskite for efficient and stable perovskite solar cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adfm.201910620", "abstract": "Recently, perovskite solar cells (PSC) with high power‐conversion efficiency (PCE) and long‐term\nstability have been achieved by employing 2D perovskite layers on 3D perovskite …", "key": "perovskite solar cells_2_1664172844782"}, {"title": "Hole transport materials in conventional structural (n–i–p) perovskite solar cells: from past to the future", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/aenm.201903403", "abstract": "… perovskites to liquid-type solar cells, the unprecedented development of perovskite solar cells\n(… Supported by high-quality perovskite films, the certified efficiency of Per-SCs has reached …", "key": "perovskite solar cells_2_1664172844782"}, {"title": "Heat dissipation effects on the stability of planar perovskite solar cells", "link": "https://pubs.rsc.org/en/content/articlehtml/2020/ee/d0ee02859b", "abstract": "… to the stability of the perovskite solar cells, which is a major … that prevent the thermal\ndecomposition of perovskite, we intend to … stable perovskite solar cells with reasonable efficiency. …", "key": "perovskite solar cells_2_1664173057058"}, {"title": "Metal oxide charge transport layers for efficient and stable perovskite solar cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adfm.201900455", "abstract": "… Perovskite solar cells (PSCs) typically have an architecture in which a perovskite light …\nBecause lead halide perovskite generates a large amount of charge near the incident light …", "key": "perovskite solar cells_2_1664173057058"}, {"title": "Characterizing the efficiency of perovskite solar cells and light-emitting diodes", "link": "https://www.sciencedirect.com/science/article/pii/S2542435120301768", "abstract": "… perovskites (MHPs) are being widely studied as a light-absorber for high-efficiency solar\ncells… globe, the power conversion efficiency of MHP solar cells has recently soared up to 25.2%. …", "key": "perovskite solar cells_2_1664174311901"}, {"title": "Metal-organic framework materials for perovskite solar cells", "link": "https://www.mdpi.com/823124", "abstract": "… solar cells. In particular, recent studies on the application of MOFs … perovskite solar cells\n(PSCs), which are highlighted as next-generation solar cells that may replace silicon solar cells, …", "key": "perovskite solar cells_2_1664174311901"}, {"title": "Recent progress and challenges of electron transport layers in organic–inorganic perovskite solar cells", "link": "https://www.mdpi.com/868286", "abstract": "… have rapidly increased by over 25% in 2019, which is comparable to silicon solar cells. …\nof perovskite solar cells. Especially we discuss recent important development of perovskite …", "key": "perovskite solar cells_2_1664174380981"}, {"title": "Optimal interfacial engineering with different length of alkylammonium halide for efficient and stable perovskite solar cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/aenm.201902740", "abstract": "… 0.05 perovskite thin … perovskite solar cells (PSCs) have received tremendous attention owing\nto their high power conversion efficiency (PCE),1-4 which exceeds that of thin film solar cells…", "key": "perovskite solar cells_2_1664174380981"}, {"title": "Enhancement of open circuit voltage for CuSCN-based perovskite solar cells by controlling the perovskite/CuSCN interface with functional molecules", "link": "https://pubs.rsc.org/en/content/articlehtml/2019/ta/c8ta12217b", "abstract": "… hole-conductors in its application as an HTM in perovskite solar cells (PSCs). Herein, for\nthe … no appreciable charge accumulation at the perovskite/CuSCN interface by successful …", "key": "perovskite solar cells_2_1664174486829"}, {"title": "Device design rules and operation principles of high-power perovskite solar cells for indoor applications", "link": "https://www.sciencedirect.com/science/article/pii/S2211285519310286", "abstract": "… In this work, the device design rules for achieving high-power perovskite solar cells under\nindoor light are suggested based on the device operation principle under low intensity light …", "key": "perovskite solar cells_2_1664174486829"}, {"title": "Bifacial Passivation of Organic Hole Transport Interlayer for NiOx‐Based p‐i‐n Perovskite Solar Cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/advs.201802163", "abstract": "… for high‐performance and stable perovskite solar cells (PSCs). Satisfying the … of perovskite,\nleading to efficient hole extraction. Moreover, when they are introduced between perovskite …", "key": "perovskite solar cells_2_1664175214015"}, {"title": "Stable and Colorful Perovskite Solar Cells Using a Nonperiodic SiO2/TiO2 Multi-Nanolayer Filter", "link": "https://pubs.acs.org/doi/abs/10.1021/acsnano.9b03098", "abstract": "… perovskite solar cells (PSCs) have received much attention as promising next-generation\nsolar cells … color tunability compared to other thin-film solar cells such as amorphous silicon (a-…", "key": "perovskite solar cells_2_1664175214015"}, {"title": "An atomistic mechanism for the degradation of perovskite solar cells by trapped charge", "link": "https://pubs.rsc.org/en/content/articlehtml/2019/nr/c9nr02193k", "abstract": "… study suggests that minimizing the trapped charges is crucial, along with designing structurally\nstable perovskite materials, in order to warrant commercially viable perovskite solar cells. …", "key": "perovskite solar cells_2_1664175310963"}, {"title": "Electronic traps and their correlations to perovskite solar cell performance via compositional and thermal annealing controls", "link": "https://pubs.acs.org/doi/abs/10.1021/acsami.8b17431", "abstract": "… In this work, the role of ionic defects on perovskite solar cell performance was examined.\nMAPbI 3 , (FA 0.83 MA 0.17 )Pb(I 0.83 Br 0.17 ) 3 , and (Cs 0.10 FA 0.75 MA 0.15 )Pb(I 0.85 Br …", "key": "perovskite solar cells_2_1664175310963"}, {"title": "Single-Layered MXene Nanosheets Doping TiO2 for Efficient and Stable Double Perovskite Solar Cells", "link": "https://pubs.acs.org/doi/abs/10.1021/jacs.0c12739", "abstract": "… double perovskite structure is the promising development direction in perovskite solar cells\n(… of the Cs 2 AgBiBr 6 double perovskite in solar cell devices. Therefore, the PCE went up by …", "key": "perovskite solar cells_2_1664175423731"}, {"title": "Efficient and Stable All-Inorganic Niobium-Incorporated CsPbI2Br-Based Perovskite Solar Cells", "link": "https://pubs.acs.org/doi/abs/10.1021/acsami.0c04577", "abstract": "… The development of a perovskite as a light absorber has been considered for low-cost and\nefficient perovskite solar cells (PVSCs) owing to their rapid increase in power conversion …", "key": "perovskite solar cells_2_1664175423731"}, {"title": "Ultra-flexible perovskite solar cells with crumpling durability: toward a wearable power source", "link": "https://pubs.rsc.org/en/content/articlehtml/2019/ee/c9ee01944h", "abstract": "… perovskite solar cells (1.2 … perovskite solar cells are demonstrated to be durable even after\n100 crumpling cycles. Our approach paves the way to fabricate flexible perovskite solar cells …", "key": "perovskite solar cells_3_1664173021657"}, {"title": "2D perovskite seeding layer for efficient air‐processable and stable planar perovskite solar cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adfm.202003081", "abstract": "… Unlike 3D perovskites, however, 2D perovskites have large exciton binding … of perovskite\nsolar cell devices. Nonetheless, hybrid active layers composed of 2D and 3D perovskites can …", "key": "perovskite solar cells_3_1664173021657"}, {"title": "Stabilization of formamidinium lead triiodide α-phase with isopropylammonium chloride for perovskite solar cells", "link": "https://www.nature.com/articles/s41560-021-00802-z", "abstract": "… 3 perovskite crystallization on the efficiency and stability of the final perovskite solar cells (…\nMoreover, forming a high-quality stabilized α-phase FAPbI 3 perovskite film with large grain …", "key": "perovskite solar cells_3_1664173021657"}, {"title": "Efficient Vacuum-Deposited Perovskite Solar Cells with Stable Cubic FA1–xMAxPbI3", "link": "https://pubs.acs.org/doi/abs/10.1021/acsenergylett.0c01473", "abstract": "… perovskite films and solar cells. We and others have previously reported the fabrication of\nperovskite solar cells … Cs + ) and mixed halide perovskites, a wide bandgap absorber suitable …", "key": "perovskite solar cells_3_1664174259745"}, {"title": "Record-efficiency flexible perovskite solar cell and module enabled by a porous-planar structure as an electron transport layer", "link": "https://pubs.rsc.org/en/content/articlehtml/2020/ee/d0ee02164d", "abstract": "… flexible solar cell (with aperture area of 0.1 cm 2 ) and sub-module (with an aperture area of\n100 cm 2 ), respectively, marking the highest PCEs among flexible perovskite solar cells and …", "key": "perovskite solar cells_3_1664174259745"}, {"title": "Bifacial stamping for high efficiency perovskite solar cells", "link": "https://pubs.rsc.org/en/content/articlehtml/2021/xx/c8ee02730g", "abstract": "… efficiency thin film solar cells. The most commonly used perovskite photovoltaic materials for\n… MAPbI 3 became the primary perovskite material used for perovskite solar cells because of …", "key": "perovskite solar cells_3_1664174259745"}, {"title": "Nonaromatic Green‐Solvent‐Processable, Dopant‐Free, and Lead‐Capturable Hole Transport Polymers in Perovskite Solar Cells with High Efficiency", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/aenm.201902662", "abstract": "… With the recent developments in the efficiency of perovskite solar cells (PSCs), diverse …\nstrength is considered to be nondestructive to the perovskite lattice to prevent lead leakage. This …", "key": "perovskite solar cells_4_1664174818445"}, {"title": "Inkjet‐Printed Mesoporous TiO2 and Perovskite Layers for High Efficiency Perovskite Solar Cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/ente.201800905", "abstract": "… will be useful for the commercialization of perovskite solar cells, we sought to develop an …\nthem in perovskite solar cells. We report, herein, high efficiency perovskite solar cells with DOD …", "key": "perovskite solar cells_4_1664174818445"}, {"title": "Molecular engineering of organic spacer cations for efficient and stable formamidinium perovskite solar cell", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/aenm.202001759", "abstract": "… Improved stability of the LD/3D hybrid perovskite solar cells by the addition of LD perovskites.\na) PCE decays of the corresponding solar cells under the continuous illumination 100 mW …", "key": "perovskite solar cells_4_1664174818445"}, {"title": "Multifunctional chemical linker imidazoleacetic acid hydrochloride for 21% efficient and stable planar perovskite solar cells", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adma.201902902", "abstract": "… in perovskite solar cell. ImAcHCl can provide a chemical bridge between SnO 2 and perovskite\nthrough … interaction with perovskite via imidazolium cation in ImAcHCl and iodide anion in …", "key": "perovskite solar cells_4_1664174818445"}, {"title": "Conformal quantum dot–SnO2 layers as electron transporters for efficient perovskite solar cells", "link": "https://www.science.org/doi/abs/10.1126/science.abh1885", "abstract": "… Mesoporous titanium dioxide is commonly used as the electron transport layer in perovskite\nsolar cells, but electron transport layers based on tin(IV) oxide quantum dots could be more …", "key": "perovskite solar cells_4_1664174961633"}, {"title": "Enhanced electrical properties of Li-salts doped mesoporous TiO2 in perovskite solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S2542435121000842", "abstract": "… Perovskite solar cells (PSCs) are promising photovoltaic technology products because of …\nThe high efficiency of PSCs mainly comes from the perovskite itself and also from its transport …", "key": "perovskite solar cells_4_1664174961633"}, {"title": "Enhanced stability of MAPbI3 perovskite solar cells using poly (p-chloro-xylylene) encapsulation", "link": "https://www.nature.com/articles/s41598-019-51945-9", "abstract": "… MAPbI 3 perovskite was fabricated using the two-step spin-… of the MAPbI 3 solar cells, and\nthe active solar cell area was … Parylene-C-coated MAPbI 3 solar cell, and we confirmed that the …", "key": "perovskite solar cells_4_1664174961633"}, {"title": "A vertically oriented two-dimensional Ruddlesden–Popper phase perovskite passivation layer for efficient and stable inverted perovskite solar cells", "link": "https://pubs.rsc.org/en/content/articlehtml/2022/ee/d2ee00759b", "abstract": "… Two-dimensional Ruddlesden–Popper (RP) phase perovskites are gaining … in perovskite\nsolar cells (PSCs). However, owing to their anisotropic structural features, the RP perovskite …", "key": "perovskite solar cells_4_1664174961633"}, {"title": "Effect of TiO2 particle size and layer thickness on mesoscopic perovskite solar cells", "link": "https://www.sciencedirect.com/science/article/pii/S0169433217334050", "abstract": "… transport layers in perovskite solar cells, which help to extract electrons from the perovskite\nlight-… of such layer-containing perovskite solar cells. Time-resolved photoluminescence decay …", "key": "perovskite solar cells_4_1664175182238"}, {"title": "A Review on Reducing Grain Boundaries and Morphological Improvement of Perovskite Solar Cells from Methodology and Material‐Based Perspectives", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smtd.201900569", "abstract": "… solar cells as photovoltaics by Miyasaka and co-workers in 2009,1 perovskite solar cells (…\nsingle-junction and of 28.0% with multijunction solar cells in 2019.2 With this dramatic growth, …", "key": "perovskite solar cells_4_1664175182238"}, {"title": "Efficient and stable graded CsPbI3− xBrx perovskite solar cells and submodules by orthogonal processable spray coating", "link": "https://www.sciencedirect.com/science/article/pii/S2542435120306097", "abstract": "… Organic-inorganic hybrid perovskite materials have recently attracted considerable attention…\nThe past decade has seen a rapid efficiency progress of perovskite solar cells (PSCs) from …", "key": "perovskite solar cells_4_1664175182238"}, {"title": "Semi-transparent perovskite solar cells with bidirectional transparent electrodes", "link": "https://www.sciencedirect.com/science/article/pii/S2211285520312763", "abstract": "… In this study, we report on high performance semi-transparent perovskite solar cells (PSCs) …\nFurthermore, with diluted perovskite solution, we able to achieve PCE of 13.61% and AVT of …", "key": "perovskite solar cells_4_1664175182238"}, {"title": "Some Features of Dye-sensitized Solar Cell Combining with Single-walled Carbon Nanotubes", "link": "https://www.koreascience.or.kr/article/JAKO201409864555521.page", "abstract": "A dye-sensitized solar cell (DSSC) was fabricated with a nanocrystalline $ TiO_2 $ film\nelectrode on FTO glass, N719 dye, electrolytes (or $ CsSnI_3 $), and counter Pt electrode by …", "key": "Spatial arrangement of carbon  cited by_1_16637788"}, {"title": "Ag Nanoparticle–Functionalized Open-Ended Freestanding TiO2 Nanotube Arrays with a Scattering Layer for Improved Energy Conversion Efficiency in Dye …", "link": "https://www.mdpi.com/144146", "abstract": "Dye-sensitized solar cells (DSSCs) were fabricated using open-ended freestanding TiO2\nnanotube arrays functionalized with Ag nanoparticles (NPs) in the channel to create a …", "key": "Spatial arrangement of carbon  cited by_2_16637786"}, {"title": "Enhanced Efficiency in Dye-Sensitized Solar Cells by Electron Transport and Light Scattering on Freestanding TiO2 Nanotube Arrays", "link": "https://www.mdpi.com/232378", "abstract": "Dye-sensitized solar cells (DSSCs) were fabricated with closed-or open-ended freestanding\nTiO2 nanotube arrays as photoelectrodes that were decorated with carbon materials and …", "key": "Spatial arrangement of carbon  cited by_2_16637786"}, {"title": "Heteroatom‐doped and oxygen‐functionalized nanocarbons for high‐performance supercapacitors", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/aenm.202001239", "abstract": "… Electrochemical capacitors (best known as supercapacitors) … of carbon‐based supercapacitors\nby doping other elements (… of nanocarbon‐based supercapacitors. Heteroatom doping …", "key": "supercapacitors_1_1663934470846"}, {"title": "Heteroatom‐doped and oxygen‐functionalized nanocarbons for high‐performance supercapacitors", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/aenm.202001239", "abstract": "… Electrochemical capacitors (best known as supercapacitors) … of carbon‐based supercapacitors\nby doping other elements (… of nanocarbon‐based supercapacitors. Heteroatom doping …", "key": "supercapacitors_1_1663940681192"}, {"title": "Flexible/stretchable supercapacitors with novel functionality for wearable electronics", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adma.202002180", "abstract": "… supercapacitors, we suggest a few insightful review articles on flexible supercapacitors … [\n20-23 ] Two different approaches are suggested to implement stretchability in supercapacitors: …", "key": "supercapacitors_1_1663941111992"}, {"title": "Pinecone biomass‐derived activated carbon: the potential electrode material for the development of symmetric and asymmetric supercapacitors", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/er.5548", "abstract": "Activated carbon, from biomass (pinecone), was synthesized by conventional pyrolysis/chemical\nactivation process and utilized for the fabrication of supercapacitor electrodes. The …", "key": "supercapacitors_1_1663941675342"}, {"title": "Interface-modulated uniform outer nanolayer: A category of electrodes of nanolayer-encapsulated core-shell configuration for supercapacitors", "link": "https://www.sciencedirect.com/science/article/pii/S2211285520312404", "abstract": "Capacity and cyclic stability are two major issues of interest for supercapacitors. We report\nhere a category of electrodes that are core-shell type that is encapsulated by a uniform outer …", "key": "supercapacitors_1_1663941712119"}, {"title": "Water-in-salt electrolyte enables ultrafast supercapacitors for AC line filtering", "link": "https://pubs.acs.org/doi/abs/10.1021/acsenergylett.0c02442", "abstract": "… The capacitance and response speed of WiSE supercapacitors are comparable to those\nof 1 m NaClO 4 -based supercapacitors over the entire range of the mass loadings of KB-SWNT …", "key": "supercapacitors_1_1663941919741"}, {"title": "A facile mechanochemical preparation of Co3O4@ g-C3N4 for application in supercapacitors and degradation of pollutants in water", "link": "https://www.sciencedirect.com/science/article/pii/S0304389420323505", "abstract": "Our study is aimed at synthesizing cobalt oxide (Co 3 O 4 ) with graphite carbon nitride (gC\n3 N 4 ) to form a Co 3 O 4 @gC 3 N 4 hybrid through a green mechanochemical one-pot …", "key": "supercapacitors_1_1663943059335"}, {"title": "Zinc-nickel-cobalt oxide@ NiMoO4 core-shell nanowire/nanosheet arrays for solid state asymmetric supercapacitors", "link": "https://www.sciencedirect.com/science/article/pii/S1385894719327706", "abstract": "In the search for advanced positive pseudocapacitive electrode material for potential application\nto practical energy storage and conversion devices, innovative design and alteration of …", "key": "supercapacitors_1_1663949981601"}, {"title": "Phenol-formaldehyde-resin-based activated carbons with controlled pore size distribution for high-performance supercapacitors", "link": "https://www.sciencedirect.com/science/article/pii/S1385894719317358", "abstract": "Carbon-based materials with a controlled pore size distribution are highly desirable to achieve\nfast diffusion of electrolytes and enhance supercapacitor performance. Here, we report a …", "key": "supercapacitors_1_1663950021181"}, {"title": "Potentiodynamic polarization assisted phosphorus-containing amorphous trimetal hydroxide nanofibers for highly efficient hybrid supercapacitors", "link": "https://pubs.rsc.org/en/content/articlehtml/2020/ta/c9ta13225b", "abstract": "Due to their high capacity, nickel–cobalt-based cathode materials have attracted significant\nattention as potential components of hybrid solid-state supercapacitors (HSSCs). However, …", "key": "supercapacitors_1_1663950093801"}, {"title": "Green synthesis of polypyrrole tubes using curcumin template for excellent electrochemical performance in supercapacitors", "link": "https://pubs.rsc.org/en/content/articlehtml/2020/ta/c9ta11934e", "abstract": "In this study, polypyrrole (PPy) having a unique hollow tubular structure was prepared\nthrough a simple and scalable one-step method of in situ chemical oxidative polymerization, …", "key": "supercapacitors_1_1663950186933"}, {"title": "Activated Carbon/MnO2 Composites as Electrode for High Performance Supercapacitors", "link": "https://www.mdpi.com/645634", "abstract": "… Among different kind of EES devices, supercapacitors (SCs) have the characteristics of a …\nused on a large scale for commercialized supercapacitors due to its easy processing and lower …", "key": "supercapacitors_1_1663950283959"}, {"title": "Tailoring the composition of ternary layered double hydroxides for supercapacitors and electrocatalysis", "link": "https://pubs.acs.org/doi/abs/10.1021/acs.energyfuels.1c00507", "abstract": "Layered double hydroxides (LDHs) have attracted great consideration in electrochemical\nsystems such as supercapacitors and water splitting due to their layered structures, flexible …", "key": "supercapacitors_1_1663950316731"}, {"title": "Hierarchical nanosheets of ternary CoNiFe layered double hydroxide for supercapacitors and oxygen evolution reaction", "link": "https://www.sciencedirect.com/science/article/pii/S0925838820344443", "abstract": "The preparation of stable and efficient thin films with excellent energy storage and conversion\ncapabilities has attracted great attention in the field of supercapacitors and electrocatalysis…", "key": "supercapacitors_1_1663950355272"}, {"title": "Supercapacitors based on Ti3C2Tx MXene extracted from supernatant and current collectors passivated by CVD-graphene", "link": "https://www.nature.com/articles/s41598-020-80799-9", "abstract": "… , which in turn increases the capacitance of the supercapacitors. It is found that the capacitance\nof the graphene-based supercapacitors is more than 1.5 times of the capacitance without …", "key": "supercapacitors_1_1663950408425"}, {"title": "Advanced Cu0. 5Co0. 5Se2 nanosheets and MXene electrodes for high-performance asymmetric supercapacitors", "link": "https://www.sciencedirect.com/science/article/pii/S1385894719328682", "abstract": "Transition-metal chalcogenides (TMCs) have attracted numerous interests in the field of energy\nstorage owing to their exceptional electrical conductivity, ultrahigh specific capacity, etc. …", "key": "supercapacitors_1_1663950469914"}, {"title": "Scalable green synthesis of hierarchically porous carbon microspheres by spray pyrolysis for high-performance supercapacitors", "link": "https://www.sciencedirect.com/science/article/pii/S1385894719322156", "abstract": "… ), referred to as supercapacitors, have attracted tremendous … been utilized as electrodes for\nsupercapacitors. However, their … are inadequate for commercial supercapacitors owing to the …", "key": "supercapacitors_1_1663950514736"}, {"title": "Perspective on high‐energy carbon‐based supercapacitors", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/eem2.12102", "abstract": "… of carbon‐based supercapacitors, their energy density, which … high energy density of\nsupercapacitors. We first address the … and provide our insight into high‐energy supercapacitors. …", "key": "supercapacitors_2_1663941030558"}, {"title": "Perspective on 3D-designed micro-supercapacitors", "link": "https://www.sciencedirect.com/science/article/pii/S0264127520303312", "abstract": "As an energy storage device to operate miniaturized electronics, micro-supercapacitors (MSCs)\nhave been developed for the past decades. One of main drawback in realization of …", "key": "supercapacitors_2_1663941030558"}, {"title": "Structural engineering and surface modification of MOF-derived cobalt-based hybrid nanosheets for flexible solid-state supercapacitors", "link": "https://www.sciencedirect.com/science/article/pii/S2405829720302828", "abstract": "… As a newly-developed sustainable power supply, flexible supercapacitors … However, the main\nweakness of supercapacitors, … The construction of asymmetric supercapacitors (ASCs) with …", "key": "supercapacitors_2_1663941466900"}, {"title": "All-soft supercapacitors based on liquid metal electrodes with integrated functionalized carbon nanotubes", "link": "https://pubs.acs.org/doi/abs/10.1021/acsnano.0c00129", "abstract": "… -soft supercapacitors for integrated … supercapacitors in a parallel-plate arrangement were\ninvestigated without and with applied mechanical deformation. The fabricated supercapacitors …", "key": "supercapacitors_2_1663941466900"}, {"title": "Comparison of activated carbons prepared by one-step and two-step chemical activation process based on cotton stalk for supercapacitors application", "link": "https://www.sciencedirect.com/science/article/pii/S0360544220322519", "abstract": "… of supercapacitors still suffers from the low energy density as a principal weakness [8].\nBriefly, supercapacitors can … metal oxides-based supercapacitors [9], conductive polymers-based …", "key": "supercapacitors_2_1663941582023"}, {"title": "Optimizing electrochemically active surfaces of carbonaceous electrodes for ionogel based supercapacitors", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adfm.202002053", "abstract": "Ionic liquids (ILs) or solidified ionic liquids, known as ionogels, have been actively employed\nin supercapacitors (SCs) owing to their superior electrochemical stabilities to aqueous and …", "key": "supercapacitors_2_1663941582023"}, {"title": "Electrical and mathematical modeling of supercapacitors: Comparison", "link": "https://www.mdpi.com/1996-1073/15/3/693", "abstract": "Supercapacitors are energy storage devices with high electrical power densities and long\nspanlife. Therefore, supercapacitor-based energy storage systems have been employed for a …", "key": "supercapacitors_2_1663942585765"}, {"title": "Green flexible graphene–inorganic‐hybrid micro‐supercapacitors made of fallen leaves enabled by ultrafast laser pulses", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/adfm.202107768", "abstract": "The development of green flexible micro‐supercapacitors (MSCs) is one of the biggest\nchallenges in future wearable electronics. Flexible MSCs are mainly produced from non‐…", "key": "supercapacitors_2_1663942585765"}, {"title": "Fundamentals and recent progress of Sn-based electrode materials for supercapacitors: A comprehensive review", "link": "https://www.sciencedirect.com/science/article/pii/S2352152X22011860", "abstract": "… Supercapacitors are extremely capable electrochemical … electrochemical performance of\nsupercapacitors, among which … of Sn-based electrode materials for supercapacitors to date via …", "key": "supercapacitors_2_1663943252191"}, {"title": "Highly conducting, extremely durable, phosphorylated cellulose-based ionogels for renewable flexible supercapacitors", "link": "https://www.sciencedirect.com/science/article/pii/S2405829719310323", "abstract": "A renewable cellulose-based dual network ionogel electrolyte is synthesized by\nphosphorylating and dissolving a microcrystalline cellulose network in a tailor-made 1,3-…", "key": "supercapacitors_2_1663943252191"}, {"title": "One-step development of octahedron-like CuCo2O4@ Carbon fibers for high-performance supercapacitors electrodes", "link": "https://www.sciencedirect.com/science/article/pii/S092583882032003X", "abstract": "In this study, a facile one-step calcination-free approach is introduced to synthesize the\ncopper-cobalt oxide octahedron-like structure (CCOOS). The as-prepared CCOOS on carbon …", "key": "supercapacitors_3_1663942702726"}, {"title": "Ultrafast long-life zinc-ion hybrid supercapacitors constructed from mesoporous structured activated carbon", "link": "https://www.sciencedirect.com/science/article/pii/S0169433220319772", "abstract": "… search for alternatives to conventional supercapacitors (eg, the … supercapacitors and\nrechargeable batteries into one device, the research and development of hybrid supercapacitors …", "key": "supercapacitors_3_1663942702726"}, {"title": "Large-area and 3D polyaniline nanoweb film for flexible supercapacitors with high rate capability and long cycle life", "link": "https://pubs.acs.org/doi/abs/10.1021/acsaem.0c01140", "abstract": "… flexible supercapacitors. … supercapacitors, the electrochemical performances of capacitance,\nrate capability, and cycle life should be further improved to develop flexible supercapacitors. …", "key": "supercapacitors_3_1663942702726"}, {"title": "Unveiling the diffusion-controlled operation mechanism of all-in-one type electrochromic supercapacitors: overcoming slow dynamic response with ternary gel …", "link": "https://www.sciencedirect.com/science/article/pii/S2405829721004086", "abstract": "All-in-one electrochromic supercapacitors (ECSs) based on a single electrochromic (EC)\ngel layer are an attractive electronic component owing to their structural simplicity and …", "key": "supercapacitors_3_1663943318804"}, {"title": "Sensible design of open-porous spherical architectures for hybrid supercapacitors with improved high-rate capability", "link": "https://www.sciencedirect.com/science/article/pii/S1567173920300043", "abstract": "… For the preparation of full-cell systems for hybrid supercapacitors, the negative/positive …\nhybrid supercapacitors were assembled as cylindrical cells (⌀22 × 45 mm 2 ). Supercapacitors of …", "key": "supercapacitors_3_1663943318804"}, {"title": "Encapsulation of Co3O4 Nanocone Arrays via Ultrathin NiO for Superior Performance Asymmetric Supercapacitors", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/smll.202005414", "abstract": "… devices, such as batteries, supercapacitors, and fuel cells have been … of supercapacitors\nover battery systems, leaving more room in developing high energy density supercapacitors …", "key": "supercapacitors_3_1663943318804"}, {"title": "History and perspectives on ultrafast supercapacitors for AC line filtering", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/aenm.202003306", "abstract": "Supercapacitors (SCs) are considered to be a promising energy storage device owing to their\nhigh‐power characteristics and long‐term cycling stabilities. Recently, ultrafast SCs have …", "key": "supercapacitors_4_1663941193898"}, {"title": "Recent advances in design of flexible electrodes for miniaturized supercapacitors", "link": "http://ir.lzu.edu.cn/handle/262010/416726", "abstract": "The increasing demands of portable, flexible, and wearable electronics have greatly stimulated\nthe development of miniaturized supercapacitors (MSCs) with features of high flexibility, …", "key": "supercapacitors_4_1663941193898"}, {"title": "Vanadium nitride for aqueous supercapacitors: a topic review", "link": "https://pubs.rsc.org/en/content/articlehtml/2020/ta/d0ta01490g", "abstract": "Supercapacitors have emerged as the most attractive complementary devices between batteries\nand conventional capacitors, while a high performance electrode material is key to their …", "key": "supercapacitors_4_1663941193898"}, {"title": "2D metal Zn nanostructure electrodes for high‐performance Zn ion supercapacitors", "link": "https://onlinelibrary.wiley.com/doi/abs/10.1002/aenm.201902981", "abstract": "Recent supercapacitors show a high power density with long‐term cycle life time in energy‐powering\napplications. A supercapacitor based on a single metal electrode accompanying …", "key": "supercapacitors_4_1663941193898"}, {"title": "Novel pyridinium iodide containing siloxane high performance electrolyte for dye-sensitized solar cell", "link": "https://www.koreascience.or.kr/article/JAKO201329063578305.page", "abstract": "A new type of solid and gel-state ionics based on siloxane pyridinium iodides was\nsynthesized and used as electrolytes in dye-sensitized solar cells. The resulting electrolytes …", "key": "Synthesis of a novel imidazoli cited by_1_16637723"}, {"title": "Preparation and Characterization of Tetra-Imidazolium Hydroxide Polyphenylene Membranes via Nickel Catalyzed C–C Coupling Polymerization", "link": "https://www.mdpi.com/135232", "abstract": "Imidazolium hydroxide anion exchange membranes functionalized with conjugated\ntetraphenylethylene moieties were synthesized via Ni (0) catalyzed polymerization by …", "key": "Synthesis of a novel imidazoli cited by_1_16637727"}, {"title": "Accelerating F-doping in transparent conducting F-doped SnO2 films for electrochromic energy storage devices", "link": "https://www.sciencedirect.com/science/article/pii/S0272884220319659", "abstract": "In this study, we designed a unique method for increasing F-doping concentration in F-\ndoped SnO 2 (FTO) films, without the extra addition of NH 4 F as a doping source, using …", "key": "Transparent conducting oxides  cited by_1_16637799"}]